Revit 2025 API
ExternalDataInstanceRemovingFromDocumentEventArgs Class
 The event arguments used by the ExternalDataInstanceRemovingFrom event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ExternalDataInstanceRemovingFromDocumentEventArgs : RevitAPIPreDocEventArgs
Public Class ExternalDataInstanceRemovingFromDocumentEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class ExternalDataInstanceRemovingFromDocumentEventArgs : public RevitAPIPreDocEventArgs
type ExternalDataInstanceRemovingFromDocumentEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The ExternalDataInstanceRemovingFromDocumentEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Document |  The document associated with the event.
(Inherited from RevitAPIPreDocEventArgs)
InstanceId |  The Revit id of the external data instance being removed from Revit document.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
TypeId |  The type id of the external data instance id being removed from Revit document.
Top
Methods
Name | Description
Cancel |  When the event is cancellable, may call the Cancel() method to cancel it.
(Inherited from RevitAPIPreEventArgs)
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace